Revit 2026 API

# RebarTrimExtendDataCreateEndConstraint Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CreateEndConstraint(
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```vb
Public Function CreateEndConstraint (
	targetReferences As IList(Of Reference),
	isConstraintToCover As Boolean,
	offsetValue As Double
) As Boolean
```
```cpp
public:
bool CreateEndConstraint(
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```fsharp
member CreateEndConstraint :
        targetReferences : IList<Reference> *
        isConstraintToCover : bool *
        offsetValue : float -> bool
```

#### Parameters

targetReferences IListReference

isConstraintToCover Boolean

offsetValue Double

#### Return Value

Boolean

#### Reference

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace